meeting/agenda/2025/10-21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 139 Agenda 2025-10-21</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 139 Agenda 2025-10-21</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>
<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).
</p>

<p>
The <a href="https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09">Zoom meeting</a> ID is 831 9996 6275; the passcode is 707664.
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>

<p>
Heads up: daylight saving time ends in the UK and Europe on 26 October 2025. It
ends in the United States on 2 November 2025. Our meetings are scheduled on
European civil time, consequently, our meeting of 28 October 2025 will occur one
hour <b>later</b> in the United States at 12:00EDT.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>
<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2025/10-14.html">the previous meeting</a>.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 21 October 2025.
</p>

<p>
The next meeting is planned for 28 October 2025.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[5/5]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
None recorded.
</p>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2256">#2256</a>: 2216 All atomic types become ordered</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2222">#2222</a>: 2217 bin:decode-string: Input encoding</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2208">#2208</a>: 675 (part) Update XSLT streamability rules</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2124">#2124</a>: 573 Functions to Construct Trees</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2120">#2120</a>: 2007 Revised design for xsl:array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2255">#2255</a>: 2254 Fix spelling of nevertheless</li>
</ul>
</div>
</div>
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1885">#1885</a>: Use the spcification grammar markup to define the regular expression grammar in F&amp;O</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1111">#1111</a>: xsl:pipeline</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/760">#760</a>: Serialize functions: consistency</li>
</ul>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2251">#2251</a>: 323 Add select attribute to xsl:text</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2249">#2249</a>: 2221 fn:unparsed-text: Encoding, BOM handling</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2248">#2248</a>: 2148b XDM Recognize that Base URI property may be invalid</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: Deferred Evaluation in XPath - the f:generator record</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2246">#2246</a>: 2233 Expand xsl:analyze-string; introduce fn:regex-groups()</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2223">#2223</a>: 2193 fn:parse-xml, fn:doc: Drop security options</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2213">#2213</a>: 2047 External resources and security</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2208">#2208</a>: 675 (part) Update XSLT streamability rules</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2205">#2205</a>: 2190 Drop binary input for parse-csv and parse-json</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2120">#2120</a>: 2007 Revised design for xsl:array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.6.5.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1777">#1777</a>: Shallow copy in XSLT with maps and arrays</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1584">#1584</a>: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1045">#1045</a>: Functions to manage namespace usage</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1011">#1011</a>: fn:transform() improvements</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/407">#407</a>: XSLT-specific context properties used in function items</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/272">#272</a>: Setting parameter values in xsl:use-package</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-pr-2249" class="outline-3">
<h3 id="pr-2249"><span class="section-number-3">2.1.</span> PR #2249: 2221 fn:unparsed-text: Encoding, BOM handling</h3>
<div class="outline-text-3" id="text-pr-2249">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2249">#2249</a>
</p>
</div>
</div>
<div id="outline-container-pr-2248" class="outline-3">
<h3 id="pr-2248"><span class="section-number-3">2.2.</span> PR #2248: 2148b XDM Recognize that Base URI property may be invalid</h3>
<div class="outline-text-3" id="text-pr-2248">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2248">#2248</a>
</p>
</div>
</div>
<div id="outline-container-pr-2223" class="outline-3">
<h3 id="pr-2223"><span class="section-number-3">2.3.</span> PR #2223: 2193 fn:parse-xml, fn:doc: Drop security options</h3>
<div class="outline-text-3" id="text-pr-2223">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2223">#2223</a>
</p>
</div>
</div>
<div id="outline-container-pr-2213" class="outline-3">
<h3 id="pr-2213"><span class="section-number-3">2.4.</span> PR #2213: 2047 External resources and security</h3>
<div class="outline-text-3" id="text-pr-2213">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2213">#2213</a>
</p>
</div>
</div>
<div id="outline-container-pr-2205" class="outline-3">
<h3 id="pr-2205"><span class="section-number-3">2.5.</span> PR #2205: 2190 Drop binary input for parse-csv and parse-json</h3>
<div class="outline-text-3" id="text-pr-2205">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2205">#2205</a>
</p>
</div>
</div>
<div id="outline-container-pr-2251" class="outline-3">
<h3 id="pr-2251"><span class="section-number-3">2.6.</span> PR #2251: 323 Add select attribute to xsl:text</h3>
<div class="outline-text-3" id="text-pr-2251">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2251">#2251</a>
</p>
</div>
</div>
<div id="outline-container-pr-2246" class="outline-3">
<h3 id="pr-2246"><span class="section-number-3">2.7.</span> PR #2246: 2233 Expand xsl:analyze-string; introduce fn:regex-groups()</h3>
<div class="outline-text-3" id="text-pr-2246">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2246">#2246</a>
</p>
</div>
</div>
<div id="outline-container-pr-2120" class="outline-3">
<h3 id="pr-2120"><span class="section-number-3">2.8.</span> PR #2120: 2007 Revised design for xsl:array</h3>
<div class="outline-text-3" id="text-pr-2120">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2120">#2120</a>
</p>
</div>
</div>
<div id="outline-container-pr-2019" class="outline-3">
<h3 id="pr-2019"><span class="section-number-3">2.9.</span> PR #2019: 1776: XSLT template rules for maps and array</h3>
<div class="outline-text-3" id="text-pr-2019">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>
</p>
</div>
</div>
<div id="outline-container-pr-2208" class="outline-3">
<h3 id="pr-2208"><span class="section-number-3">2.10.</span> PR #2208: 675 (part) Update XSLT streamability rules</h3>
<div class="outline-text-3" id="text-pr-2208">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2208">#2208</a>
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
